{
  "backend/main.mo": "Main actor defining user data types (profiles, plans, metrics, settings) and CRUD operations for storing and retrieving user data by Principal, with migration support.",
  "backend/migration.mo": "Migration module that transforms old user data schema (with timeWindows field) to new schema (without timeWindows) by mapping user profiles and preserving other fields.",
  "feature_evidence.json": "Feature evidence report documenting removal of time windows selection step from onboarding, elimination of time window data fields from state management, and removal of RemindersConfig component.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components including hooks, pages, and UI components for onboarding, reset flow, library, plan management, progress tracking, and settings.",
  "frontend/index.css": "Global Tailwind styles with OKLCH color system defining CSS variables for light/dark themes, accessibility features, and design tokens for the warm, calming UI.",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div for React app mounting, titled 'Tranquility Lounge Psychological Tuning'.",
  "frontend/src/App.tsx": "Root application component configuring React Query, TanStack Router with all routes, theme provider, accessibility provider, and splash/crisis disclaimer flow on initial load.",
  "frontend/src/components/dashboard/IntensityCheck.tsx": "Dashboard card component with slider (0-10) for logging current intensity level and optional text input for describing emotional state.",
  "frontend/src/components/dashboard/QuickAccessButtons.tsx": "Dashboard component displaying four quick-access navigation cards (Reset, My Plan, Library, Progress) with icons and hover effects.",
  "frontend/src/components/dashboard/StreakDisplay.tsx": "Displays a user's consecutive daily check-in streak using localStorage to track last check-in date and count, with logic to increment, maintain, or reset the streak.",
  "frontend/src/components/dashboard/SuggestedNextStep.tsx": "Shows personalized action suggestions based on user progress, recommending either a first Reset, library exploration, or continued learning with navigation buttons.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout wrapper that conditionally renders navigation bar and reset button, hiding them on splash, crisis, and onboarding pages.",
  "frontend/src/components/layout/NavigationBar.tsx": "Bottom navigation bar (top on desktop) with five main sections: Home, Library, Tools, Progress, and Settings, highlighting the active route.",
  "frontend/src/components/layout/ResetButton.tsx": "Floating action button that navigates to the Reset page, positioned bottom-right and hidden when already on the Reset page.",
  "frontend/src/components/library/CategorySection.tsx": "Renders a section of lessons filtered by category with a title, description, and grid of lesson cards.",
  "frontend/src/components/library/LessonCard.tsx": "Displays a lesson card with category badge, completion status, estimated duration, and button to start or review the lesson.",
  "frontend/src/components/onboarding/EscalationPatternsStep.tsx": "Onboarding step for selecting escalation patterns (racing mind, irritability, shutdown, etc.) with checkboxes and icon-based cards.",
  "frontend/src/components/onboarding/GoalFocusStep.tsx": "Onboarding step for selecting a primary goal focus area (stress regulation, sleep, productivity, etc.) with single-select cards.",
  "frontend/src/components/onboarding/PreferredToolsStep.tsx": "Onboarding step for selecting preferred regulation tools (breath work, audio guidance, journaling, etc.) with multi-select checkboxes.",
  "frontend/src/components/onboarding/ResetPlanStep.tsx": "Final onboarding step that displays the generated personalized Reset plan summary with crisis disclaimer and completion button.",
  "frontend/src/components/onboarding/StepIndicator.tsx": "A visual step indicator component that displays progress through a multi-step process with numbered circles, check marks for completed steps, and connecting lines between steps.",
  "frontend/src/components/onboarding/TimeWindowsStep.tsx": "Empty file with no content.",
  "frontend/src/components/plan/DailyRoutineBuilder.tsx": "A placeholder card component for creating up to 3 daily routines (morning, midday, evening) with a coming soon message and an Add Routine button.",
  "frontend/src/components/plan/RemindersConfig.tsx": "Empty file with no content.",
  "frontend/src/components/plan/ResetSequenceCustomizer.tsx": "Displays the user's personalized reset sequence steps with their names and core questions in styled cards, fetched from user data.",
  "frontend/src/components/plan/ToolPreferences.tsx": "Displays the user's preferred regulation tools and practices as badges, fetching data from the user's personalized plan.",
  "frontend/src/components/progress/DailyMetricsLogger.tsx": "A form with three sliders (sleep quality, focus readiness, energy level) rated 1-5 that saves daily metrics to user data with date stamps.",
  "frontend/src/components/progress/HabitTracker.tsx": "A placeholder card component for tracking daily habits with a coming soon message and an Add Habit button.",
  "frontend/src/components/progress/RegulationChart.tsx": "Displays regulation ratings showing average intensity reduction per reset and a list of the 5 most recent reset sessions with before/after comparisons.",
  "frontend/src/components/progress/WeeklyInsights.tsx": "Generates and displays personalized insights based on regulation ratings, reset count, and favorite tools, with fallback messaging for new users.",
  "frontend/src/components/reset/ActStep.tsx": "A step in the reset flow where users select one micro-action from six options (communicate, move, pause, connect, learn, complete) displayed as clickable cards with icons.",
  "frontend/src/components/reset/AnchorStep.tsx": "A step allowing users to optionally select environment adjustments (lighting, sound, scent, posture, screens) via checkboxes with navigation buttons.",
  "frontend/src/components/reset/CloseStep.tsx": "Final reset step where users rate their current intensity after the reset, showing before/after comparison with visual indicators for increase, decrease, or no change.",
  "frontend/src/components/reset/CoreStep.tsx": "A form step component for the 'Core' phase of emotional reset, prompting users to write their interpretation of what's really happening beneath their surface emotions. Includes a textarea input with validation requiring non-empty content.",
  "frontend/src/components/reset/NameItStep.tsx": "A form step component for the 'Name It' phase where users rate emotional intensity (0-10 slider) and select from six predefined emotional states (overwhelmed, anxious, frustrated, sad, numb, restless). Validates that both intensity and state are selected.",
  "frontend/src/components/reset/RegulateStep.tsx": "A form step component for selecting a regulation practice tool (paced breathing, grounding, or audio guidance) with duration estimates. Includes back/continue navigation buttons.",
  "frontend/src/components/settings/AboutSection.tsx": "Displays app information including version (1.0.0), copyright for Valentina D. Diaconu, and a footer link crediting caffeine.ai as the build platform.",
  "frontend/src/components/settings/AccessibilitySettings.tsx": "Provides accessibility controls for text size (small/medium/large) and high contrast mode toggle, persisting preferences to user data via API mutations.",
  "frontend/src/components/settings/CrisisInfoLink.tsx": "Displays UK emergency crisis contact information (999, Samaritans, SHOUT, NHS 111) with a disclaimer that the app is not a substitute for professional care or emergency services.",
  "frontend/src/components/settings/DataExport.tsx": "Provides a button to export all user data (profile, plans, tracking metrics, local storage) as a timestamped JSON file download.",
  "frontend/src/components/settings/DeleteAccount.tsx": "Implements account deletion with a confirmation dialog requiring the user to type 'DELETE', then calls the delete mutation and redirects to onboarding.",
  "frontend/src/components/settings/EmergencyContacts.tsx": "Displays UK crisis hotlines (Samaritans, NHS 111) and user-saved emergency contacts with phone numbers, plus an 'Add Contact' button.",
  "frontend/src/components/tools/ToolCard.tsx": "Displays a tool card with name, category, favorite toggle (star icon), and 'Open Tool' button. Manages favorite status by updating user data via API mutation.",
  "frontend/src/data/lessons.ts": "Defines the Lesson interface and exports an array of lesson content covering cognitive patterns, flexibility, and emotion regulation with practice exercises and journal prompts.",
  "frontend/src/hooks/useAccessibility.ts": "Provides a React context and hook for managing accessibility settings (text size and high contrast mode), syncing with user data and applying CSS custom properties to the document root.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication provider and hook using AuthClient, managing login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useOnboarding.ts": "Manages onboarding flow state across 4 steps, tracking user selections for goal focus, escalation patterns, preferred tools, and reset plan.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user data, including profile, ratings, habits, favorite tools, emergency contacts, and accessibility settings via the backend actor.",
  "frontend/src/hooks/useResetFlow.ts": "Manages a 7-step reset flow state, tracking intensity ratings, current state, regulation tools, interpretations, actions, and environment adjustments.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for theming (light/dark/high-contrast modes), dynamic text sizing, and color tokens using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/CrisisDisclaimer.tsx": "Displays a crisis disclaimer page with UK emergency contact numbers and requires user acknowledgment via checkbox before allowing navigation to onboarding.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that redirects to onboarding if not completed, displays welcome message, intensity check, suggested next steps, streak display, and quick access buttons.",
  "frontend/src/pages/Lesson.tsx": "Displays individual lesson content with title, estimated time, practice exercises, micro-tasks, and journal prompts; tracks completion in localStorage and allows navigation back to library.",
  "frontend/src/pages/Library.tsx": "Library page with search functionality and tabbed interface organizing psychoeducation lessons by the Four-Level Regulation Model categories (Core, Regulate, Act, Anchor).",
  "frontend/src/pages/Onboarding.tsx": "Multi-step onboarding flow collecting user's goal focus, escalation patterns, preferred tools, and reset plan; saves data to backend and navigates to dashboard upon completion.",
  "frontend/src/pages/Plan.tsx": "Tabbed interface for managing personalized regulation plan including daily routines, reset sequence customization, and tool preferences.",
  "frontend/src/pages/PrivacyPolicy.tsx": "Displays comprehensive privacy policy explaining data collection, storage (blockchain and local), usage, GDPR rights, retention, and security measures with navigation back to settings.",
  "frontend/src/pages/Progress.tsx": "Progress tracking page with tabs for regulation charts, daily metrics logging, and habit tracking, plus weekly insights display.",
  "frontend/src/pages/Reset.tsx": "Main Reset flow page implementing the guided 7-step regulation process (Name It, Regulate, Core, Act, Anchor, Close) with progress tracking, step validation, and saving regulation ratings to user data upon completion.",
  "frontend/src/pages/Settings.tsx": "Settings page providing access to accessibility options, emergency contacts, crisis information, data export, account deletion, and about section organized in card-based layout.",
  "frontend/src/pages/Splash.tsx": "Splash screen displaying 'Tranquility Lounge Psychological Tuning' branding with copyright attribution to Valentina D. Diaconu and animated loading indicator.",
  "frontend/src/pages/Tools.tsx": "Tools library page organizing regulation, core, behaviour, and environment tools in tabs with favorites filter toggle and grid-based tool card display.",
  "frontend/src/utils/language.ts": "Language utility defining supportive, non-pathologizing terminology constants and helper function for context-appropriate supportive messages, avoiding clinical/diagnostic terms.",
  "frontend/src/utils/localStorage.ts": "Local storage utility for managing sensitive user data (journal entries, private notes, detailed logs) with store, retrieve, clear, and export functions.",
  "frontend/src/utils/offlineStorage.ts": "Offline caching utility for tool data with functions to cache, retrieve, and check online status for offline-first functionality.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color system using OKLCH color space, extended theme with animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing the Four-Level Regulation Model architecture, MVP scope, British English non-pathologizing language requirements, and known navigation blocking issue requiring fix."
}